# NumberOfVGridlines Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DividedSurface..::..NumberOfVGridlines Property
DividedSurface Class See Also
---
Get the number of V-gridlines used on the surface.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int NumberOfVGridlines { get; }
```

Visual Basic
---
```text
Public ReadOnly Property NumberOfVGridlines As Integer
	Get
```

Visual C++
---
```text
public:
property int NumberOfVGridlines {
	int get ();
}
```

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace